Revit 2026 API

# FabricationHostedInfo Class

---

The fabrication hosted element information.

SystemObject Autodesk.Revit.DBFabricationHostedInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationHostedInfo : IDisposable
```
```vb
Public Class FabricationHostedInfo
	Implements IDisposable
```
```cpp
public ref class FabricationHostedInfo : IDisposable
```
```fsharp
type FabricationHostedInfo =
    class
        interface IDisposable
    end
```

The FabricationHostedInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostId | Returns the identifier of the host. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | DisconnectFromHost | Disconnects the part from the host. |
|  | Dispose | Releases all resources used by the FabricationHostedInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBearerCenterline | Gets the centerline of the bearer. The method is applicable only for bearer hanger. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PlaceOnHost(ElementId, Connector, Double) | Places the part on the specified host. |
|  | PlaceOnHost(ElementId, Connector, Double, Double) | Places the part on the specified host. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A fabrication part may have a host, the FabricationHostedInfo stores the host information for the fabrication part.

#### Reference

Autodesk.Revit.DB Namespace